---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceReference
source: html/5e83fae9-60e8-52b5-48c7-fc281e44af18.htm
---
# ExternalResourceReference Methods

Creates an ExternalResourceReference representing a local file managed
 by Revit's built-in server.